NextFOAM-2501/tutorials/incompressible/overPimpleDyMFoam/rotatingSquare/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh;

solver          multiSolidBodyMotionSolver;

multiSolidBodyMotionSolverCoeffs
{
    background
    {
        solidBodyMotionFunction linearMotion;
        linearMotionCoeffs
        {
            velocity    (0 0 0);
        }
    }

    movingZone
    {
        solidBodyMotionFunction rotatingMotion;
        origin  (0.005 0 0.005);
        axis    (0 0 1);
        omega   20;
    }
}


// ************************************************************************* //
